apemangr/Repetidor-nRF52-SDK-17.1.0/main.c
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "app_error.h"
#include "app_nus_client.h"
#include "app_nus_server.h"
#include "app_timer.h"
#include "app_uart.h"
#include "app_util.h"
#include "ble.h"
#include "ble_gap.h"
#include "ble_hci.h"
#include "ble_nus.h"
#include "bsp_btn_ble.h"
#include "leds.h"
#include "nordic_common.h"
#include "nrf_ble_gatt.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"
#include "timers.h"
#include "variables.h"

NRF_BLE_GATT_DEF(m_gatt); /**< GATT module instance. */
static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;
static uint16_t m_ble_nus_max_data_len =
    BLE_GATT_ATT_MTU_DEFAULT - OPCODE_LENGTH -
    HANDLE_LENGTH; /**< Maximum length of data (in bytes) that can be
                      transmitted to the peer by the Nordic UART service module.
                    */

/**@brief Function for handling asserts in the SoftDevice.
 *
 * @details This function is called in case of an assert in the SoftDevice.
 *
 * @warning This handler is only an example and is not meant for the final
 * product. You need to analyze how your product is supposed to react in case of
 * assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num     Line number of the failing assert call.
 * @param[in] p_file_name  File name of the failing assert call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name)
{
	app_error_handler(0xDEADBEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer. */
static void base_timer_init(void)
{
	ret_code_t err_code = app_timer_init();
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling characters received by the Nordic UART Service
 * (NUS).
 *
 * @details This function takes a list of characters of length data_len and
 * prints the characters out on UART. If @ref ECHOBACK_BLE_UART_DATA is set, the
 * data is sent back to sender.
 */
static void ble_nus_chars_received_uart_print(uint8_t *p_data,
                                              uint16_t data_len)
{
	ret_code_t ret_val;

	NRF_LOG_DEBUG("Receiving data.");
	NRF_LOG_HEXDUMP_DEBUG(p_data, data_len);

	for (uint32_t i = 0; i < data_len; i++)
	{
		do
		{
			ret_val = app_uart_put(p_data[i]);
			if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY))
			{
				NRF_LOG_ERROR("app_uart_put failed for index 0x%04x.", i);
				APP_ERROR_CHECK(ret_val);
			}
		} while (ret_val == NRF_ERROR_BUSY);
	}
	if (p_data[data_len - 1] == '\r')
	{
		while (app_uart_put('\n') == NRF_ERROR_BUSY);
	}
	if (ECHOBACK_BLE_UART_DATA)
	{
		// Send data back to the peripheral.
		do
		{
			/*ret_val = ble_nus_c_string_send(&m_ble_nus_c, p_data, data_len);
			if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY))
			{
			    NRF_LOG_ERROR("Failed sending NUS message. Error 0x%x. ",
			ret_val); APP_ERROR_CHECK(ret_val);
			}*/
		} while (ret_val == NRF_ERROR_BUSY);
	}
}

/**@brief   Function for handling app_uart events.
 *
 * @details This function receives a single character from the app_uart module
 * and appends it to a string. The string is sent over BLE when the last
 * character received is a 'new line' '\n' (hex 0x0A) or if the string reaches
 * the maximum data length.
 */
void uart_event_handle(app_uart_evt_t *p_event)
{
	static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
	static uint16_t index = 0;
	uint32_t ret_val;

	switch (p_event->evt_type)
	{
		/**@snippet [Handling data from UART] */
		case APP_UART_DATA_READY:
			UNUSED_VARIABLE(app_uart_get(&data_array[index]));
			index++;

			if ((data_array[index - 1] == '\n') ||
			    (data_array[index - 1] == '\r') ||
			    (index >= (m_ble_nus_max_data_len)))
			{
				NRF_LOG_DEBUG(
				    "Ready to send data over BLE NUS client and server");
				NRF_LOG_HEXDUMP_DEBUG(data_array, index);

				app_nus_client_send_data(data_array, index);

				app_nus_server_send_data(data_array, index);

				index = 0;
			}
			break;

		/**@snippet [Handling data from UART] */
		case APP_UART_COMMUNICATION_ERROR:
			NRF_LOG_ERROR("Communication error occurred while handling UART.");
			APP_ERROR_HANDLER(p_event->data.error_communication);
			break;

		case APP_UART_FIFO_ERROR:
			NRF_LOG_ERROR("Error occurred in FIFO module used by UART.");
			APP_ERROR_HANDLER(p_event->data.error_code);
			break;

		default:
			break;
	}
}

/**
 * @brief Function for handling shutdown events.
 *
 * @param[in]   event       Shutdown type.
 */
static bool shutdown_handler(nrf_pwr_mgmt_evt_t event)
{
	ret_code_t err_code;

	err_code = bsp_indication_set(BSP_INDICATE_IDLE);
	APP_ERROR_CHECK(err_code);

	switch (event)
	{
		case NRF_PWR_MGMT_EVT_PREPARE_WAKEUP:
			// Prepare wakeup buttons.
			err_code = bsp_btn_ble_sleep_mode_prepare();
			APP_ERROR_CHECK(err_code);
			break;

		default:
			break;
	}

	return true;
}

NRF_PWR_MGMT_HANDLER_REGISTER(shutdown_handler, APP_SHUTDOWN_HANDLER_PRIORITY);

/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const *p_ble_evt, void *p_context)
{
	ret_code_t err_code;
	ble_gap_evt_t const *p_gap_evt = &p_ble_evt->evt.gap_evt;

	switch (p_ble_evt->header.evt_id)
	{
		case BLE_GAP_EVT_TIMEOUT:
			if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN)
			{
				NRF_LOG_INFO("Connection Request timed out.");
			}
			break;

		case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
			// Pairing not supported.
			err_code = sd_ble_gap_sec_params_reply(
			    p_ble_evt->evt.gap_evt.conn_handle,
			    BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
			APP_ERROR_CHECK(err_code);
			break;

		case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
			// Accepting parameters requested by peer.
			err_code = sd_ble_gap_conn_param_update(
			    p_gap_evt->conn_handle,
			    &p_gap_evt->params.conn_param_update_request.conn_params);
			APP_ERROR_CHECK(err_code);
			break;

		case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
		{
			NRF_LOG_DEBUG("PHY update request.");
			ble_gap_phys_t const phys = {
			    .rx_phys = BLE_GAP_PHY_AUTO,
			    .tx_phys = BLE_GAP_PHY_AUTO,
			};
			err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle,
			                                 &phys);
			APP_ERROR_CHECK(err_code);
		}
		break;

		case BLE_GATTC_EVT_TIMEOUT:
			// Disconnect on GATT Client timeout event.
			NRF_LOG_DEBUG("GATT Client Timeout.");
			err_code = sd_ble_gap_disconnect(
			    p_ble_evt->evt.gattc_evt.conn_handle,
			    BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
			APP_ERROR_CHECK(err_code);
			break;

		case BLE_GATTS_EVT_TIMEOUT:
			// Disconnect on GATT Server timeout event.
			NRF_LOG_DEBUG("GATT Server Timeout.");
			err_code = sd_ble_gap_disconnect(
			    p_ble_evt->evt.gatts_evt.conn_handle,
			    BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
			APP_ERROR_CHECK(err_code);
			break;

		default:
			break;
	}

	// Forward BLE events to the app NUS server module
	app_nus_server_ble_evt_handler(p_ble_evt);

	// Forward BLE events to the app NUS client module
	app_nus_client_ble_evt_handler(p_ble_evt);
}

/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
	ret_code_t err_code;

	err_code = nrf_sdh_enable_request();
	APP_ERROR_CHECK(err_code);

	// Configure the BLE stack using the default settings.
	// Fetch the start address of the application RAM.
	uint32_t ram_start = 0;
	err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
	APP_ERROR_CHECK(err_code);

	// Enable BLE stack.
	err_code = nrf_sdh_ble_enable(&ram_start);
	APP_ERROR_CHECK(err_code);

	// Register a handler for BLE events.
	NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler,
	                     NULL);
}

/**@brief Function for handling events from the GATT library. */
void gatt_evt_handler(nrf_ble_gatt_t *p_gatt, nrf_ble_gatt_evt_t const *p_evt)
{
	if (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED)
	{
		// NRF_LOG_INFO("ATT MTU exchange completed.");

		m_ble_nus_max_data_len =
		    p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
		// NRF_LOG_INFO("Ble NUS max data length set to 0x%X(%d)",
		// m_ble_nus_max_data_len, m_ble_nus_max_data_len);
	}
}

/**@brief Function for initializing the GATT library. */
void gatt_init(void)
{
	ret_code_t err_code;

	err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
	APP_ERROR_CHECK(err_code);

	err_code =
	    nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
	APP_ERROR_CHECK(err_code);

	err_code = nrf_ble_gatt_att_mtu_central_set(&m_gatt,
	                                            NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling events from the BSP module.
 *
 * @param[in] event  Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
	ret_code_t err_code;

	switch (event)
	{
		case BSP_EVENT_SLEEP:
			nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_SYSOFF);
			break;

		case BSP_EVENT_DISCONNECT:

			break;

		default:
			break;
	}
}

/**@brief Function for initializing the UART. */
static void uart_init(void)
{
	ret_code_t err_code;

	app_uart_comm_params_t const comm_params = {
	    .rx_pin_no = RX_PIN_NUMBER,
	    .tx_pin_no = TX_PIN_NUMBER,
	    .rts_pin_no = RTS_PIN_NUMBER,
	    .cts_pin_no = CTS_PIN_NUMBER,
	    .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
	    .use_parity = false,
	    .baud_rate = UART_BAUDRATE_BAUDRATE_Baud115200};

	APP_UART_FIFO_INIT(&comm_params, UART_RX_BUF_SIZE, UART_TX_BUF_SIZE,
	                   uart_event_handle, APP_IRQ_PRIORITY_LOWEST, err_code);

	APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing buttons and leds. */
static void buttons_leds_init(void)
{
	ret_code_t err_code;
	bsp_event_t startup_event;

	err_code = bsp_init(BSP_INIT_LEDS, bsp_event_handler);
	APP_ERROR_CHECK(err_code);

	err_code = bsp_btn_ble_init(NULL, &startup_event);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the timer. */
static void timer_init(void)
{
	ret_code_t err_code = app_timer_init();
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the nrf log module. */
static void log_init(void)
{
	ret_code_t err_code = NRF_LOG_INIT(NULL);
	APP_ERROR_CHECK(err_code);

	NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
	ret_code_t err_code;
	err_code = nrf_pwr_mgmt_init();
	APP_ERROR_CHECK(err_code);
}

void app_nus_server_on_data_received(const uint8_t *data_ptr,
                                     uint16_t data_length)
{
	// Output the data to the UART
	printf("Server data received: ");
	for (int i = 0; i < data_length; i++) printf("%c", data_ptr[i]);
	printf("\r\n");

	// Forward the data from the client to the server
	app_nus_client_send_data(data_ptr, data_length);
}

void app_nus_client_on_data_received(const uint8_t *data_ptr,
                                     uint16_t data_length)
{
	// Output the data to the  UART
	printf("Client data received: ");
	for (int i = 0; i < data_length; i++) printf("%c", data_ptr[i]);
	printf("\r\n");

	// Forward the data from the client to the server
	app_nus_server_send_data(data_ptr, data_length);
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details Handles any pending log operations, then sleeps until the next event
 * occurs.
 */
static void idle_state_handle(void)
{
	if (NRF_LOG_PROCESS() == false)
	{
		nrf_pwr_mgmt_run();
	}
}

int main(void)
{
	ret_code_t err_code;

	NRF_LOG_RAW_INFO(
	    "\n\033[1;36m====================\033[0m "
	    "\033[1;33mINICIO DEL SISTEMA\033[0m"
	    " \033[1;36m====================\033[0m\n");
	NRF_LOG_RAW_INFO(
	    "\t\t Firmware 0.0.1 por\033[0m "
	    "\033[1;90mCrea\033[1;31mLab\033[0m\n\n");

	log_init();
	base_timer_init();
	uart_init();
	buttons_leds_init();
	power_management_init();
	ble_stack_init();
	gatt_init();

	// Inicializa los servicios de servidor y cliente NUS
	app_nus_server_init(app_nus_server_on_data_received);
	app_nus_client_init(app_nus_client_on_data_received);

	// nrf_delay_ms(1000);
	//  Timers de encendido y reposo
	timers_app_init();

	NRF_LOG_RAW_INFO("\n> Buscando emisor...\n");

	timers_start_cycle();


	// Enter main loop.
	for (;;)
	{
		idle_state_handle();
	}
}
